In [1]:
import pandas as pd

In [2]:
import numpy as np
from numpy.random import randn

In [3]:
df=pd.DataFrame({'A':[10,40,np.nan,np.nan],'B':[20,50,np.nan,30],'C':[30,60,np.nan,np.nan]},index=['a','b','c','d'])

In [4]:
df

      A     B     C
a  10.0  20.0  30.0
b  40.0  50.0  60.0
c   NaN   NaN   NaN
d   NaN  30.0   NaN

In [5]:
df.dropna()

      A     B     C
a  10.0  20.0  30.0
b  40.0  50.0  60.0

In [13]:
df.dropna(thresh=1) #remove the row which has atleast one not nan value

      A     B     C
a  10.0  20.0  30.0
b  40.0  50.0  60.0
d   NaN  30.0   NaN

In [18]:
df.replace({20:200})

      A      B     C
a  10.0  200.0  30.0
b  40.0   50.0  60.0
c   NaN    NaN   NaN
d   NaN   30.0   NaN

In [21]:
df.replace(20,200)

      A      B     C
a  10.0  200.0  30.0
b  40.0   50.0  60.0
c   NaN    NaN   NaN
d   NaN   30.0   NaN